In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[[1981,1980,1982]]

In [4]:
df_new = df_new.head()

In [5]:
df_new

   1981  1980  1982
0    39    16    39
1     0     1     0
2    67    80    71
3     1     0     0
4     0     0     0

# Sorting Index

In [8]:
df_new.sort_index(axis=0) #By Default ascending=True  #axis=0 => ROW

   1981  1980  1982
0    39    16    39
1     0     1     0
2    67    80    71
3     1     0     0
4     0     0     0

In [9]:
df_new.sort_index(axis=0, ascending=False)

   1981  1980  1982
4     0     0     0
3     1     0     0
2    67    80    71
1     0     1     0
0    39    16    39

# Sorting Columns

In [10]:
df_new = df[[1981,1980,1982]]
df_new = df_new.head()
df_new

   1981  1980  1982
0    39    16    39
1     0     1     0
2    67    80    71
3     1     0     0
4     0     0     0

In [11]:
df_new.sort_index(axis=1) #By Default ascending=True  #axis=1 => COLUMN

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71
3     0     1     0
4     0     0     0

In [13]:
df_new.sort_index(axis=1, ascending=False)

   1982  1981  1980
0    39    39    16
1     0     0     1
2    71    67    80
3     0     1     0
4     0     0     0

In [15]:
df_new = df[['Coverage','AreaName','Type']]
df_new = df_new.head()
df_new

     Coverage AreaName        Type
0  Foreigners     Asia  Immigrants
1  Foreigners   Europe  Immigrants
2  Foreigners   Africa  Immigrants
3  Foreigners  Oceania  Immigrants
4  Foreigners   Europe  Immigrants

In [16]:
df_new.sort_index(axis=1)

  AreaName    Coverage        Type
0     Asia  Foreigners  Immigrants
1   Europe  Foreigners  Immigrants
2   Africa  Foreigners  Immigrants
3  Oceania  Foreigners  Immigrants
4   Europe  Foreigners  Immigrants

In [17]:
df_new.sort_index(axis=1, ascending=False)

         Type    Coverage AreaName
0  Immigrants  Foreigners     Asia
1  Immigrants  Foreigners   Europe
2  Immigrants  Foreigners   Africa
3  Immigrants  Foreigners  Oceania
4  Immigrants  Foreigners   Europe